tap "homebrew/services"

# CLI tools
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "jq"
brew "yq"
brew "k9s"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "ollama", restart_service: :changed
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tldr"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Modern replacements
brew "git-delta"
brew "dust"
brew "duf"
brew "procs"
brew "sd"
brew "xh"

# Shell power-ups
brew "direnv"
brew "mise"

# Languages & runtimes
brew "go"
brew "node"
brew "python@3.14"
brew "uv"
brew "pipx"

# Docker
cask "orbstack"

# Cloud & AI
brew "gemini-cli"
brew "opencode"

# Fonts
cask "font-caskaydia-cove-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-nerd-font"

# Terminals
cask "alacritty"
cask "ghostty"

# Apps
cask "android-platform-tools"
cask "bruno"
cask "gcloud-cli"
cask "halloy"
cask "lm-studio"
cask "maccy"
cask "vlc"
cask "zed"
