tap "homebrew/services"
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "ollama", restart_service: :changed
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "alacritty"
cask "font-caskaydia-cove-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "ghostty"
cask "halloy"
