# CLI tools
brew "bat"
brew "btop"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gnupg"
brew "htop"
brew "jq"
brew "yq"
brew "k9s"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "ollama", restart_service: :changed
brew "ripgrep"
brew "starship"
brew "sesh"
brew "stow"
brew "television"
brew "tmux"
brew "tldr"
brew "trash"
brew "tree"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Modern replacements
brew "git-delta"
brew "dust"
brew "duf"
brew "procs"
brew "sd"
brew "xh"

# Shell power-ups
brew "direnv"
brew "mise"
brew "mkcert"
brew "pre-commit"

# Languages & runtimes
brew "go"
brew "node"
brew "python@3.14"
brew "uv"
brew "pipx"

# Kubernetes
brew "kubernetes-cli"
brew "helm"
brew "kubectx"
brew "stern"
brew "kustomize"
brew "kubeseal"
brew "kind"

# Infra
brew "terraform"
brew "terragrunt"

# Networking
brew "cloudflared"

# Docker
cask "orbstack"

# Cloud & AI
brew "gemini-cli"
brew "opencode"

# Fonts
cask "font-caskaydia-cove-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-nerd-font"

# Terminals
cask "alacritty"
cask "ghostty"

# Apps
cask "android-platform-tools"
cask "appcleaner"
cask "bruno"
cask "claude"
cask "dbeaver-community"
cask "firefox"
cask "gcloud-cli"
cask "github"
cask "halloy"
cask "lm-studio"
cask "maccy"
cask "ngrok"
cask "swiftbar"
cask "visual-studio-code"
cask "vlc"
cask "zed"
