tap "argoproj/tap"
tap "fairwindsops/tap"
tap "fluxcd/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "noahgorstein/tap"
tap "ykursadkaya/openlens"
brew "argocd"
brew "argocd-autopilot"
brew "arkade"
brew "atlas", link: false
brew "python@3.11"
brew "awscli"
brew "bat"
brew "glib"
brew "cairo"
brew "pycparser"
brew "cffi"
brew "cli53"
brew "cloc"
brew "cowsay"
brew "dasel"
brew "docker", link: false
brew "docutils"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "unbound"
brew "gnutls"
brew "go"
brew "grep"
brew "harfbuzz"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "k9s"
brew "kind"
brew "krb5"
brew "kube-linter"
brew "kube-score"
brew "kubeconform"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeseal"
brew "kubeval"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "libssh"
brew "libwebsockets"
brew "qemu"
brew "lima"
brew "minikube"
brew "mkcert"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "mosquitto"
brew "neovim"
brew "nss"
brew "nvm"
brew "octant"
brew "openjdk@11"
brew "openjdk@17"
brew "openssl@1.1"
brew "operator-sdk"
brew "perl"
brew "postgresql@14"
brew "pre-commit"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "ripgrep"
brew "siege"
brew "sonar-scanner"
brew "sonarqube"
brew "starship"
brew "stern"
brew "tcping"
brew "telnet"
brew "terraform"
brew "terraformer"
brew "terragrunt"
brew "tfenv", link: false
brew "tgenv", link: false
brew "tmux"
brew "tree"
brew "vim"
brew "virtualenv"
brew "w3m"
brew "watch"
brew "wget"
brew "wimlib"
brew "yazi"
brew "youtube-dl"
brew "z"
brew "zellij"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "fairwindsops/tap/pluto"
brew "fluxcd/tap/flux"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-database-tools"
brew "noahgorstein/tap/jqp"
cask "alacritty"
cask "appcleaner"
cask "azure-data-studio"
cask "chromium"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
cask "github"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "kitty"
cask "klogg"
cask "lazy"
cask "ngrok"
cask "nosqlbooster-for-mongodb"
cask "openlens"
cask "opera"
cask "postman"
cask "robo-3t"
cask "soapui"
cask "swiftbar"
cask "todoist"
cask "visual-studio-code"
cask "vnc-viewer"
cask "wezterm"
cask "zoom"
vscode "4ops.terraform"
vscode "betajob.modulestf"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "davidfreer.go-to-character-position"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-mocha-test-adapter"
vscode "hbenl.vscode-test-explorer"
vscode "jorgedorio.darkula-theme"
vscode "khaeransori.json2csv"
vscode "kubernetes-tools.k8s"
vscode "meezilla.json"
vscode "miclo.sort-typescript-imports"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "nrwl.angular-console"
vscode "omartawfik.github-actions-vscode"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "vscode-icons-team.vscode-icons"
